{
  "plugins": {
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip"
    },
    "async.nvim": {
      "src": "https://github.com/lewis6991/async.nvim"
    },
    "black-metal-theme-neovim": {
      "src": "https://github.com/metalelf0/black-metal-theme-neovim"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp",
      "version": ">=0.0.0"
    },
    "compile-mode.nvim": {
      "src": "https://github.com/ej-shafran/compile-mode.nvim"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets"
    },
    "gruber-darker.nvim": {
      "src": "https://github.com/blazkowolf/gruber-darker.nvim"
    },
    "lazydev.nvim": {
      "src": "https://github.com/folke/lazydev.nvim"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "mini.pick": {
      "src": "https://github.com/nvim-mini/mini.pick"
    },
    "nvim": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "nvim-colorizer.lua": {
      "src": "https://github.com/norcalli/nvim-colorizer.lua"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-jdtls": {
      "src": "https://github.com/mfussenegger/nvim-jdtls"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "oxocarbon.nvim": {
      "src": "https://github.com/nyoom-engineering/oxocarbon.nvim"
    },
    "pack-manager.nvim": {
      "src": "https://github.com/mplusp/pack-manager.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "refactoring.nvim": {
      "src": "https://github.com/ThePrimeagen/refactoring.nvim"
    },
    "vim-moonfly-colors": {
      "src": "https://github.com/bluz71/vim-moonfly-colors"
    }
  }
}
